system/controlDict
/*--------------------------------*-------*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         cdiFoam;

startFrom           latestTime;
// startTime        0;

stopAt              endTime;
endTime             9248;
//endTime           18496;

deltaT              0.0285; // 0.0285;

writeControl        timeStep;
writeInterval       100;

purgeWrite          0;
writeFormat         ascii;
writePrecision      18;
writeCompression    on;

timeFormat          general;
timePrecision       6;

runTimeModifiable   true;

functions {
    // Print percentage through run
    #include        "printFracRun"

    // On-the-fly post-processing with patch average
    #includeFunc    patchAverage
}

// ************************************************************************* //
