system/blockMeshDict
/*--------------------------------*-------*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-03;
he 0.68;
hs  0.8;
ht 1.48;

vertices
(
    // Back
    (0          0           -0.1)   // 0
    (12.5       0           -0.1)   // 1
    (112.5      0           -0.1)   // 2
    (125        0           -0.1)   // 3
    (0          $hs         -0.1)   // 4
    (12.5       $hs         -0.1)   // 5
    (112.5      $hs         -0.1)   // 6
    (125        $hs         -0.1)   // 7
    (12.5       $ht         -0.1)   // 8
    (112.5      $ht         -0.1)   // 9
    // Front
    (0          0           0.1)   // 10
    (12.5       0           0.1)   // 11
    (112.5      0           0.1)   // 12
    (125        0           0.1)   // 13
    (0          $hs         0.1)   // 14
    (12.5       $hs         0.1)   // 15
    (112.5      $hs         0.1)   // 16
    (125        $hs         0.1)   // 17
    (12.5       $ht         0.1)   // 18
    (112.5      $ht         0.1)   // 19
);

blocks
(
    // nCells: <>
    // Mesh size = <> m
    // Courant No. = <>
    // Max flow velocity = 2 * Mean flow velocity = <> m/s
    // => deltaT = Co * MeshSize / MeanFlowVelocity = <> s

    hex (0 1 5 4 10 11 15 14) (200  13 1) simpleGrading (1 1 1) // Inlet
    hex (1 2 6 5 11 12 16 15) (1600 13 1) simpleGrading (1 1 1) // Spacer
    hex (2 3 7 6 12 13 17 16) (200  13 1) simpleGrading (1 1 1) // Outlet
    hex (5 6 9 8 15 16 19 18) (1600 13 1) simpleGrading (1 1 1) // Electrode
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 14 10)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 7 17 13)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (5  4 14 15)
            (8  5 18 15)
            (9  8 18 19)
            (6  9 19 16)
            (7  6 16 17)
        );
    }

    midPlane
    {
        type patch;
        faces
        (
            (0 1 11 10)
            (1 2 12 11)
            (2 3 13 12)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            // Back
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (5 8 9 6)
            // Front
            (10 11 15 14)
            (11 12 16 15)
            (12 13 17 16)
            (15 16 19 18)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
