constant/electrochemicalProperties
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      electrochemicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Electrode voltage [ V ] { Volt = kg.m2.s-3.A-1 }
EV              EV    [1 2 -3 0 0 -1 0] 0.5; // 0.4, 0.6, 0.8, 1 V

// Thermal voltage (@ 300K = 25.85 mV)
VT              VT    [1 2 -3 0 0 -1 0] 25.85E-03;

// Farday constant [ C.mol-1 ] { C = A.s }
F               F     [0 0 1 0 -1 1 0] 96485;

// Stern layer capcitance [ F ] { Farad = A2.s4.kg-1.m-2) }
CapSt           CapSt [-1 -5 4 0 0 2 0] 150E06;

// Non-electrostatic adsorption parameter
Mu              Mu [0 0 0 0 0 0 0] 1.5;

// ************************************************************************* //
