constant/transportProperties
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Diffusivity in Electrode
De              De [0 2 -1 0 0 0 0] 0.95e-09;

// Micro- and macropore porosity of the electrode
Pmi              Pmi [0 0 0 0 0 0 0] 0.3;
Pma              Pma [0 0 0 0 0 0 0] 0.4;

// ************************************************************************* //
