0/U.orig
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        // // Uniforma velocity profile
        // type            fixedValue;
        // value           uniform (4.38e-4 0 0);

        // Fully developed parabolic velocity profile
        type            codedFixedValue;
        value           uniform (4.38e-4 0 0);
        name            fullyDeveloped;
        code
        #{
            const vector ctrOfPatch (0, 0, 0);
            const vectorField& ctrOfFace = this->patch().Cf();
            const vector n (1, 0, 0);
            const vector y (0, 1, 0);

            const scalarField coord = (((ctrOfFace - ctrOfPatch) & y) / h);

            const scalar U_avg = 4.38e-4;

            operator == (n * 2 * U_avg * (1 - sqr(coord)));
        #};
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    midPlane
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
