system/fvSolution
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    c
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    p
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    pD
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
}

residualControl
{
    c               1e-9;
    p               1e-9;
    U               1e-9;
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    equations
    {
        "c"             0.2;
        "p.*"           0.2;
    }
}


// ************************************************************************* //
// 
