system/decomposeParDict
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Compulsory entries
numberOfSubdomains 4;
method          simple;


// Method Coeffecients
simpleCoeffs
{
    n               (2 2 1); // Number of subdomains in x, y, z
    delta           0.001;   // Cell skew factor
}


// Distributed data entries (optional)
distributed     no;          // Is the data distributed across several disks?
roots           ( );         // Root paths to case directories; <rt1> is the
                             // root path for node 1, etc.

// ************************************************************************* //
